app/controllers/api/v1/answer_controller.rb

    def index
        @answer = Answer.where(visit_id: params[:visit_id], formulary_id: params[:formulary_id], question_id: params[:question_id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."deleted_at" IS NULL AND "answers"."visit_id" = $1 AND "answers"."formulary_id" = $2 AND "answers"."question_id" = $3  [["visit_id", 1], ["formulary_id", 1], ["question_id", 1]]

    def create
        @answer = Answer.new(answer_params.merge(visit_id: params[:visit_id], formulary_id: params[:formulary_id], question_id: params[:question_id]))
        if @answer.save
---
INSERT INTO "answers" ("content", "formulary_id", "question_id", "visit_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "contenttest2"], ["formulary_id", 1], ["question_id", 1], ["visit_id", 1], ["created_at", "2020-03-01 17:23:49.426380"], ["updated_at", "2020-03-01 17:23:49.426380"]]

    def update
        if @answer
            @answer.update(answer_params)
---
UPDATE "answers" SET "answered_at" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["answered_at", "2020-03-01 00:00:00"], ["updated_at", "2020-03-01 17:27:20.409745"], ["id", 2]]

    def destroy
        if @answer
            @answer.destroy
---
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 2]]

    def find_answer
        @answer = Answer.find(params[:id])
---
SELECT "answers".* FROM "answers" WHERE "answers"."deleted_at" IS NULL AND "answers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]