app/controllers/api/v1/formulary_controller.rb

    def index
        @formulary = Formulary.all
---
SELECT "formularies".* FROM "formularies" WHERE "formularies"."deleted_at" IS NULL

    def show
        @formulary = Formulary.find(params[:id])
---
SELECT "formularies".* FROM "formularies" WHERE "formularies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @formulary = Formulary.new(formulary_params)
        if @formulary.save
---
INSERT INTO "formularies" ("nome", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome", "teste2"], ["created_at", "2020-03-01 17:11:33.732629"], ["updated_at", "2020-03-01 17:11:33.732629"]]

    def update
        @formulary = Formulary.find(params[:id])
        if @formulary
            @formulary.update(formulary_params)
---
SELECT "formularies".* FROM "formularies" WHERE "formularies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "formularies" SET "nome" = $1, "updated_at" = $2 WHERE "formularies"."id" = $3  [["nome", "teste3"], ["updated_at", "2020-03-01 17:12:01.411502"], ["id", 2]]

    def destroy
        @formulary = Formulary.find(params[:id])
        if @formulary
            @formulary.destroy
---
SELECT "formularies".* FROM "formularies" WHERE "formularies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "formularies" WHERE "formularies"."id" = $1  [["id", 2]]