app/controllers/api/v1/question_controller.rb

    def index
        @question = Question.where(formulary_id: params[:formulary_id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."deleted_at" IS NULL AND "questions"."formulary_id" = $1  [["formulary_id", 3]]

    def show
        @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."deleted_at" IS NULL

    def create
        @question = Question.new(question_params.merge(formulary_id: params[:formulary_id]))

        if @question.save
---
INSERT INTO "questions" ("nome", "formulary_id", "tp_pergunta", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "testequestionID3"], ["formulary_id", 3], ["tp_pergunta", "testeID3"], ["created_at", "2020-03-01 20:27:21.287659"], ["updated_at", "2020-03-01 20:27:21.287659"]]

    def update
        @question = Question.find(params[:id])
        if @question
            @question.update(question_params)
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "questions" SET "tp_pergunta" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["tp_pergunta", "qualquer coisa denovo"], ["updated_at", "2020-03-01 17:17:11.786773"], ["id", 2]]

    def destroy
        @question = Question.find(params[:id])
        if @question
            @question.destroy
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 2]]

    def find_question
        @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."deleted_at" IS NULL AND "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]