app/controllers/api/v1/user_controller.rb

    def index
        @user = User.all
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL

    def show
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("nome", "senha", "email", "cpf", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "teste5"], ["senha", "12345678"], ["email", "Teste5@teste5"], ["cpf", "12345678911"], ["created_at", "2020-03-01 00:49:17.699731"], ["updated_at", "2020-03-01 00:49:17.699731"]]

    def update
        @user = User.find(params[:id])
        if @user
            @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "nome" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["nome", "teste5put"], ["updated_at", "2020-03-01 00:50:34.425760"], ["id", 5]]

    def destroy
        @user = User.find(params[:id])
        if @user
            @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]