app/controllers/api/v1/visit_controller.rb

    def index
        @visit = Visit.where(user_id: params[:user_id])
---
SELECT "visits".* FROM "visits" WHERE "visits"."deleted_at" IS NULL AND "visits"."user_id" = $1  [["user_id", 1]]

    def create

         @visit = Visit.new(visit_params.merge(user_id: params[:user_id]))

        if @visit.save
---
INSERT INTO "visits" ("data", "status", "user_id", "checkin_at", "checkout_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @visit = Visit.find(params[:id])
        if @visit
            @visit.update(visit_params)
---
SELECT "visits".* FROM "visits" WHERE "visits"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "visits" SET "data" = $1, "status" = $2, "updated_at" = $3 WHERE "visits"."id" = $4  [["data", "2020-03-03 00:00:00"], ["status", "aprovado"], ["updated_at", "2020-03-01 03:40:27.554004"], ["id", 4]]

    def find_visit
        @visit = Visit.find(params[:id])
---
SELECT "visits".* FROM "visits" WHERE "visits"."deleted_at" IS NULL AND "visits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]